# Библиотека -> Функции

## Импортирование и использование библиотеки
# import math
#
# a = math.cos(math.pi)
# print(a)

## Импортирование функций (или переменных)

# from math import cos
#
# a = cos(3.14)
# print(a)

# from math import *
#
# print(log2(8))

from turtle import *

# forward(x) - движение вперед - fd(x)
# backward(x) - движение назад - bk(x)
# left(x) - поворот налево на x градусов - lt(x)
# right(x) - поворот направо на x градусов - rt(x)

# up() - поднять хвост
# down() - опустить хвост

# goto(x, y) - перемещение в определенную координату
# dot(x) - чертит точку (x - жирность точки)

# done() - заморозить выполнение
# tracer(0) - убрать задержку
# screensize(4000, 4000) - добавить ползунки для холста